tobozo/ESP32-BLECollector/ESP32-BLECollector/Display.h
  #warning WROVER KIT DETECTED !!


#elif defined ARDUINO_TWATCH_BASE || defined ARDUINO_TWATCH_2020_V1 || defined ARDUINO_TWATCH_2020_V2 // TTGO T-Watch

  // => Hardware select
  // #define LILYGO_WATCH_2019_WITH_TOUCH        // To use T-Watch2019 with touchscreen, please uncomment this line
  // #define LILYGO_WATCH_2019_NO_TOUCH       // To use T-Watch2019 Not touchscreen , please uncomment this line
  // #define LILYGO_WATCH_BLOCK               // To use T-Watch Block , please uncomment this line
  // #define LILYGO_WATCH_2020_V1              // To use T-Watch2020 , please uncomment this line

/*
  // TODO: implement pcf8563.h from https://github.com/Xinyuan-LilyGO/TTGO-T-Watch
  #undef HAS_EXTERNAL_RTC
  #define HAS_EXTERNAL_RTC true // will use RTC_SDA and RTC_SCL from settings.h

  #define RTC_SDA 21
  #define RTC_SC  22
*/

  #ifdef ARDUINO_TWATCH_BASE
    #undef hasHID
    #define hasHID() (bool)false // disable buttons
  #elif defined LILYGO_WATCH_2019_WITH_TOUCH || defined LILYGO_WATCH_2019_NO_TOUCH
    #undef BLE_FS_TYPE
    #define BLE_FS_TYPE "sdcard" // "sd" = fs::SD, "sdcard" = fs::SD_MMC
    #warning "Scroll is fucked up with LILYGO_WATCH_2019 displays :-("
  #else // TWatch 2020-v1 (default), defined ARDUINO_TWATCH_2020_V1 || defined ARDUINO_TWATCH_2020_V2 // TTGO T-Watch
    #undef BLE_FS
    #undef BLE_FS_TYPE
    #undef SD_begin
    #undef USE_SD_UPDATER

/*
    #include <LITTLEFS.h>
    //#define SPIFFS LITTLEFS
    #define BLE_FS LITTLEFS // inherited from ESP32-Chimera-Core
    #define BLE_FS_TYPE "spiffs" // sd = fs::SD, sdcard = fs::SD_MMC, spiffs = fs::SPIFFS, littlefs = fs::LITTLEFS
    #define SD_begin BLE_FS.begin(true, "/" BLE_FS_TYPE)
*/


    #include <SPIFFS.h>
    #define BLE_FS SPIFFS // inherited from ESP32-Chimera-Core
    #define BLE_FS_TYPE "spiffs" // sd = fs::SD, sdcard = fs::SD_MMC, spiffs = fs::SPIFFS
    #define SD_begin BLE_FS.begin()

    #undef hasHID
    //#undef hasXPaxShield
    #define hasHID() (bool)false
    //#define hasXPaxShield() (bool) false

  #endif

  #undef tft_initOrientation
  #define tft_initOrientation() tft.setRotation(0) // default orientation for hardware scroll

  #undef BASE_BRIGHTNESS
  #define BASE_BRIGHTNESS 16

  #undef SCROLL_OFFSET
  #define SCROLL_OFFSET 320-240 // these 240x240 displays have graphic memory mapped as 320x240


#else

  #error "NO SUPPORTED BOARD DETECTED !!"
  #error "Either define one of the supported boards, add it to the profile selection, or uncomment this error to experiment"

#endif

#include <ESP32-Chimera-Core.h> // https://github.com/tobozo/ESP32-Chimera-Core

#if !defined ECC_VERSION_MAJOR || !defined ECC_VERSION_MAJOR || !defined ECC_VERSION_MAJOR
  #error "This app only uses ESP32-Chimera-Core >= 1.2.3"
#else
  #if ((ECC_VERSION_MAJOR << 16) | (ECC_VERSION_MINOR << 8) | (ECC_VERSION_PATCH)) >= ((1 << 16) | (2 << 8) | (3))
    // yay, minimal version requirements are met !
  #else
    #error "This app needs ESP32-Chimera-Core >= 1.2.3"
  #endif
#endif


#if defined USE_SD_UPDATER
  #define SDU_APP_NAME PLATFORM_NAME " BLE Collector" // title for SD-Updater UI
  #include <M5StackUpdater.h> // https://github.com/tobozo/M5Stack-SD-Updater
#endif

#define tft M5.Lcd // syntax sugar
//#include "HID_XPad.h" // external HID


static TFT_eSprite gradientSprite( &tft );  // gradient background
static TFT_eSprite heapGraphSprite( &tft ); // activity graph
static TFT_eSprite hallOfMacSprite( &tft ); // mac address badge holder

static bool isQuerying = false; // state maintained while SD is accessed, useful when SD is used instead of SD_MMC
// TODO: make this SD-driver dependant rather than platform dependant
static bool isInQuery()
{
  return isQuerying; // M5Stack uses SPI SD, isolate SD accesses from TFT rendering
}




// TFT_eSPI / LGFX / Chimera-Core API

void tft_begin()
{

  M5.begin( true, true, false, false, false ); // don't start Serial

  #if HAS_EXTERNAL_RTC
    Wire.begin(RTC_SDA, RTC_SCL);
    M5.I2C.scan();
    M5.update();
  #endif
  delay( 100 );
  #ifdef __M5STACKUPDATER_H
    if( hasHID() ) {
      // build has buttons => enable SD Updater at boot
      // New SD Updater support, requires the latest version of https://github.com/tobozo/M5Stack-SD-Updater/
      #if defined M5_SD_UPDATER_VERSION_INT
        SDUCfg.setLabelMenu("<< Menu");
        SDUCfg.setLabelSkip("Launch");
        checkSDUpdater( BLE_FS, MENU_BIN, 5000, TFCARD_CS_PIN ); // Filesystem, Launcher bin path, Wait delay, Sdcard CS pin
      #else
        checkSDUpdater();
      #endif
    }
  #endif
}

void tft_setBrightness( uint8_t brightness )
{
  tft.setBrightness( brightness );
}

void tft_getTextBounds(const char *string, int16_t x, int16_t y, int16_t *x1, int16_t *y1, uint16_t *w, uint16_t *h)
{
  *w = tft.textWidth( string );
  *h = tft.fontHeight();
}

void tft_getTextBounds(const String &str, int16_t x, int16_t y, int16_t *x1, int16_t *y1, uint16_t *w, uint16_t *h)
{
  *w = tft.textWidth( str.c_str() );
  *h = tft.fontHeight();
}

void tft_fillCircle( uint16_t x, uint16_t y, uint16_t r, uint16_t color)
{
  tft.fillCircle(x, y, r, color);
}

void tft_drawCircle( uint16_t x, uint16_t y, uint16_t r, uint16_t color)
{
  tft.drawCircle(x, y, r, color);
}

void tft_fillRect( uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
  tft.fillRect(x, y, w, h, color);
}

void tft_fillTriangle( uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color)
{
  tft.fillTriangle(x0, y0, x1, y1, x2, y2, color);
}


// software scroll (very slow, but necessary for screenshots)
static int32_t s_x_tmp, s_y_tmp, s_w_tmp, s_h_tmp;
static uint16_t circularScrollBufferHSize = 240;
static uint16_t circularScrollBufferVSize = 16;
static uint16_t circularScrollBufferSize = circularScrollBufferHSize*circularScrollBufferVSize;
void tft_scrollTo(int32_t vsp)
{
  if( vsp == 0 ) return;
  //tft.getScrollRect( &s_x_tmp, &s_y_tmp, &s_w_tmp, &s_h_tmp );
  int32_t direction   = vsp>0 ? 1 : -1;
  int32_t blockHeight = abs(vsp);
  int32_t blockSize   = s_w_tmp*blockHeight;
  int32_t bottomY     = (s_y_tmp+s_h_tmp)-blockHeight;

  if( blockSize <= circularScrollBufferSize ) {
    // scroll area fits into buffer
    RGBColor * scrollArea = new RGBColor[s_w_tmp*blockHeight];
    int32_t ySrc        = 0;
    int32_t yDest       = 0;
    if( vsp < 0 ) {
      ySrc  = s_y_tmp;
      yDest = bottomY;
    } else {
      ySrc  = bottomY;
      yDest = s_y_tmp;
    }
    tft.readRectRGB( s_x_tmp, ySrc,  s_w_tmp, blockHeight, scrollArea );
    tft.scroll(0, vsp);
    tft.pushImage(   s_x_tmp, yDest, s_w_tmp, blockHeight, scrollArea );
    log_v("[block] tft.scroll(0, %d); scrollRect( %d, %d, %d, %d ) ", vsp, s_x_tmp, s_y_tmp, s_w_tmp, s_h_tmp );
    free( scrollArea );
  } else {
    // scroll area doesn't fit into buffer, need to split
    log_v("[split] tft.scroll(0, %d); scrollRect( %d, %d, %d, %d ) ", vsp, s_x_tmp, s_y_tmp, s_w_tmp, s_h_tmp );
    // how many scan lines can the buffer fit ?
    int scanLines = floor( circularScrollBufferSize / s_w_tmp );
    // how many iterations these scanLines will be required to cover the current scroll zone
    int iterations = floor( blockHeight / scanLines );
    // are there any leftover lines
    int leftover = blockHeight%scanLines;
    // go recursive
    while( iterations-- > 0 ) {
      tft_scrollTo( scanLines * direction );
    }
    // do leftover lines if any
    tft_scrollTo( leftover * direction );
  }
}


// hardware scroll
void tft_setupHScrollArea(uint16_t tfa, uint16_t vsa, uint16_t bfa)
{
  bfa += SCROLL_OFFSET; // compensate for stubborn firmware
  tft.startWrite();
  tft.writecommand(0x33);  // VSCRDEF Vertical scroll definition
  tft.writedata(tfa >> 8); // Top Fixed Area line count
  tft.writedata(tfa);
  tft.writedata(vsa >> 8); // Vertical Scrolling Area line count
  tft.writedata(vsa);
  tft.writedata(bfa >> 8); // Bottom Fixed Area line count
  tft.writedata(bfa);
  tft.endWrite();

  log_d("Init Hardware Scroll area with tfa/vsa/bfa %d/%d/%d on w/h %d/%d", tfa, vsa, bfa, scrollpanel_width(), scrollpanel_height());
}


// hardware scroll
void tft_hScrollTo(uint16_t vsp)
{
  tft.startWrite();
  tft.writecommand(0x37); // ILI9341_VSCRSADD Vertical scrolling pointer
  tft.writedata(vsp>>8);
  tft.writedata(vsp);
  tft.endWrite();
}


void tft_fillGradientHRect( uint16_t x, uint16_t y, uint16_t width, uint16_t height, RGBColor colorstart, RGBColor colorend )
{
  log_v("tft_fillGradientHRect( %d, %d, %d, %d )", x, y, width, height );
  gradientSprite.setPsram( false ); // don't bother using psram for that
  //gradientSprite.setSwapBytes( false );
  gradientSprite.setColorDepth( 16 );
  gradientSprite.createSprite( width, 1);
  tft.startWrite();
  gradientSprite.drawGradientHLine( 0, 0, width, colorstart, colorend );
  for( uint16_t h = 0; h < height; h++ ) {
    gradientSprite.pushSprite( x, y+h );
  }
  tft.endWrite();
  gradientSprite.deleteSprite();
}

